{"backend": "tensorflow", "config": [{"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 128, 128, 3], "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "bias_constraint": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8"}